// В функцию передаем коллекцию и 2 значения.
// По результату выполнения вывести все объекты массива,
// у которых одно свойство ('name' ) равно первому параметру
// или другое свойство ('age') равно второму параметру.

let obj = [{
    name: 'Вова',
    age: 22,
}, {
    name: 'Илья',
    age: 21,
}, {
    name: 'Саша',
    age: 30,
}, {
    name: 'Аня',
    age: 33,
}]

qwe = (arr, val1, val2) => {
    return arr.filter(elem => 
        elem.name === val1 ||
        elem.age === val2)
}

console.log(qwe(obj, 'Вова', 30))
